ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/TIMA0_1.0.xml
        <register id="TIMA0_CCACT_23" width="32" offset="0x78" instances="2" instaddr="0x4" description="Capture or Compare Action Registers 2/3">
            <bitfield id="ZACT" description="CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="LACT" description="CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CDACT" description="CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down." begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CUACT" description="CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up." begin="10" end="9" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2DACT" description="CCP Output Action on CC2D event." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2UACT" description="CCP Output Action on CC2U event." begin="16" end="15" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="FENACT" description="CCP Output Action on Fault Entry
This field describes the resulting action of the signal generator upon detecting a fault." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
                <bitenum id="CCP_HIGHZ" value="0x4" description="CCP output value is tristated"/>
            </bitfield>
            <bitfield id="FEXACT" description="CCP Output Action on Fault Exit
This field describes the resulting action of the signal generator upon exiting the fault condition." begin="27" end="25" width="3" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
                <bitenum id="CCP_HIGHZ" value="0x4" description="CCP output value is tristated"/>
            </bitfield>
            <bitfield id="SWFRCACT" description="CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
            </bitfield>
            <bitfield id="SWFRCACT_CMPL" description="CCP Complimentary Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately." begin="31" end="30" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP Complimentary output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP Complimentary output value is set low"/>
            </bitfield>
        </register>
        <register id="TIMA0_IFCTL_01" width="32" offset="0x80" instances="2" instaddr="0x4" description="Input Filter Control Register 0/1">
            <bitfield id="ISEL" description="Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="CCPX_INPUT" value="0x0" description="CCP of the corresponding capture compare unit"/>
                <bitenum id="CCPX_INPUT_PAIR" value="0x1" description="Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0."/>
                <bitenum id="CCP0_INPUT" value="0x2" description="CCP0 of the counter"/>
                <bitenum id="TRIG_INPUT" value="0x3" description="Trigger"/>
                <bitenum id="CCP_XOR" value="0x4" description="XOR of CCP inputs as input source (Used in Hall input mode)."/>
                <bitenum id="FSUB0" value="0x5" description="subscriber 0 event as input source."/>
                <bitenum id="FSUB1" value="0x6" description="subscriber 1 event as input source."/>
                <bitenum id="COMP0" value="0x7" description="Comparator 0 output."/>
                <bitenum id="COMP1" value="0x8" description="Comparator 1 output."/>
                <bitenum id="COMP2" value="0x9" description="Comparator 2 output."/>
            </bitfield>
            <bitfield id="INV" description="Input Inversion This bit controls whether the selected input is inverted." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOINVERT" value="0x0" description="Noninverted"/>
                <bitenum id="INVERT" value="0x1" description="Inverted"/>
            </bitfield>
            <bitfield id="FP" description="Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="_3" value="0x0" description="The division factor is 3"/>
                <bitenum id="_5" value="0x1" description="The division factor is 5"/>
                <bitenum id="_8" value="0x2" description="The division factor is 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="Consecutive" value="0x0" description="Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="Voting" value="0x1" description="Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output."/>
            </bitfield>
            <bitfield id="FE" description="Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Bypass."/>
                <bitenum id="ENABLED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        <register id="TIMA0_IFCTL_23" width="32" offset="0x88" instances="2" instaddr="0x4" description="Input Filter Control Register 2/3">
            <bitfield id="ISEL" description="Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="CCPX_INPUT" value="0x0" description="CCP of the corresponding capture compare unit"/>
                <bitenum id="CCPX_INPUT_PAIR" value="0x1" description="Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0."/>
                <bitenum id="CCP0_INPUT" value="0x2" description="CCP0 of the counter"/>
                <bitenum id="TRIG_INPUT" value="0x3" description="Trigger"/>
                <bitenum id="CCP_XOR" value="0x4" description="XOR of CCP inputs as input source (Used in Hall input mode)."/>
                <bitenum id="FSUB0" value="0x5" description="subscriber 0 event as input source."/>
                <bitenum id="FSUB1" value="0x6" description="subscriber 1 event as input source."/>
                <bitenum id="COMP0" value="0x7" description="Comparator 0 output."/>
                <bitenum id="COMP1" value="0x8" description="Comparator 1 output."/>
                <bitenum id="COMP2" value="0x9" description="Comparator 2 output."/>
            </bitfield>
            <bitfield id="INV" description="Input Inversion This bit controls whether the selected input is inverted." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOINVERT" value="0x0" description="Noninverted"/>
                <bitenum id="INVERT" value="0x1" description="Inverted"/>
            </bitfield>
            <bitfield id="FP" description="Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="_3" value="0x0" description="The division factor is 3"/>
                <bitenum id="_5" value="0x1" description="The division factor is 5"/>
                <bitenum id="_8" value="0x2" description="The division factor is 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="Consecutive" value="0x0" description="Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="Voting" value="0x1" description="Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output."/>
            </bitfield>
            <bitfield id="FE" description="Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Bypass."/>
                <bitenum id="ENABLED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
